namespace Project_2.Airplane;

public class Airplane
{
    public static string[] Hletter = new string[13] {" ", "A", "B", "C", " ", "D", "E", "F", "G", " ", "H", "J", "K" };
    
    public static string[] Mletter = new string[8] { " ", "A", "B", "C", " ", "D", "E", "F"};
    public static void new_plane()
    {
        Console.Clear();
        
        Console.ForegroundColor = ConsoleColor.Blue;
        Console.WriteLine("\nСистема создания нового типа воздушного судна");
        Console.ResetColor();
        
        Console.WriteLine("\nТаблица существующих: ");
        Console.ForegroundColor = ConsoleColor.Yellow;
        Console.WriteLine("Type\t\tSize\t\tQuantity\tPlaces");
        Console.ResetColor();
        Database.get_table("airplane");
        
        Console.WriteLine("Для выхода введите '/exit'");
        Console.Write("\nВведите тип нового ВС");
        Console.ForegroundColor = ConsoleColor.Red;
        Console.Write(" (строго ICAO обозначение!): ");
        Console.ResetColor();
        
        Console.ForegroundColor = ConsoleColor.Green;
        string? type = Console.ReadLine();
        Console.ResetColor();
        
        Console.Write("\nВведите размер вместимости");
        Console.ForegroundColor = ConsoleColor.Red;
        Console.Write(" (L - light(DHC6), M - Medium(A320), H - Hight(A350)): ");
        Console.ResetColor();
        
        Console.ForegroundColor = ConsoleColor.Green;
        string? size = Console.ReadLine();
        Console.ResetColor();
        
        Console.Write("\nВведите количество самолетов: ");
        
        Console.ForegroundColor = ConsoleColor.Green;
        string? quantity = Console.ReadLine();
        Console.ResetColor();
        
        Console.Write("\nВведите количество PAX: ");
        
        Console.ForegroundColor = ConsoleColor.Green;
        string? places = Console.ReadLine();
        Console.ResetColor();
        
        Console.Clear();
        Database.new_plane(type, size, quantity, places);
    }
    public static void salon(string size, string flight_num, string book_num)
    {
        if (size == "MEGA")
        {
            string[,] salon = new string[13, 60]
            {
                { " ", "|", "58", "57", "56", "55", "54", "53", "52", "51", "50", "49", "48", "47", "46", "45", "44", "43", "42", "41", " ", "39", "38", "37", "36", "35", "34", "33", "32", "31", "30", "29", "28", "27", "26", "25", "24", " ", "22", "21", "20", "19", "18", "17", "16", "15", "14", "13", "12", "11", "10", "09", "08", "07", "06", "05", "04", "03", "02", "01" },
                { "A", "|", "1", "1", "2", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1" },
                { "B", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "2", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1" },
                { "C", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1" },
                { " ", "|", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0" },
                { "D", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1" },
                { "E", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1" },
                { "F", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1" },
                { "G", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1" },
                { " ", "|", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0" },
                { "H", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1" },
                { "J", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1" },
                { "K", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1" }, 
            };
            
            for (int i = 0; i < salon.GetLength(0); i++)
            {
                for (int j = 0; j < salon.GetLength(1); j++)
                {
                    if (salon[i, j] == "1")
                    {
                        Console.ForegroundColor = ConsoleColor.DarkBlue;
                        Console.Write(" ■  ");
                        Console.ResetColor();
                    }
                    else if (salon[i, j] == "0")
                    {
                        Console.Write("   ");
                    }
                    else if (salon[i, j] == "2")
                    {
                        Console.ForegroundColor = ConsoleColor.Red;
                        Console.Write(" □  ");
                        Console.ResetColor();
                    }
                    else
                    {
                        Console.Write($" {salon[i, j]} ");
                    }

                }

                Console.WriteLine();
            }
        }
        else if (size == "M")
        {
            string[,] salon = new string[8, 35]
            {
                { " ", "|", "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13", "14", "15", "16", "17", "18", " ", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33" },
                { "A", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
                { "B", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
                { "C", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
                { " ", "|", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"},
                { "D", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
                { "E", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
                { "F", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
            };
            //СОХРАНЕНИЕ ИСХОДНОГО СОСТОЯНИЯ
            Database.update("flight_number", "num", flight_num, "red_places", Tool.ArrayToString(salon));
            
            
            
            
            
            
            for (int i = 0; i < salon.GetLength(0); i++)
            {
                for (int j = 0; j < salon.GetLength(1); j++)
                {
                    if (salon[i, j] == "1")
                    {
                        Console.ForegroundColor = ConsoleColor.DarkBlue;
                        Console.Write(" ■  ");
                        Console.ResetColor();
                    }
                    else if (salon[i, j] == "0")
                    {
                        Console.Write("   ");
                    }
                    else if (salon[i, j] == "2")
                    {
                        Console.ForegroundColor = ConsoleColor.Red;
                        Console.Write(" □  ");
                        Console.ResetColor();
                    }
                    else
                    {
                        Console.Write($" {salon[i, j]} ");
                    }

                }

                Console.WriteLine();
            }
        }
        else if (size == "H")
        {
            string[,] salon = new string[13, 35]
            {
                { " ", "|", "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13", "14", "15", "16", "17", "18", " ", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33" },
                { "A", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
                { "B", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
                { "C", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
                { " ", "|", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"},
                { "D", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
                { "E", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
                { "F", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
                { "G", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
                { " ", "|", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"},
                { "H", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
                { "J", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
                { "K", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
            };

            
            
            ///ПРОВЕРКА НА УЖЕ РАНДОМИЗИРОВАННЫХ РАХ
            if (Database.get_string("flight_number", "num", flight_num, 5) != "")
            {
                string? arr = Database.get_string("flight_number", "num", flight_num, 5);
                salon = Tool.StringToArray(arr);
            }
            else
            {
                Random rnd = new Random();
                int n = rnd.Next(80, 180);
                for (int i = 0; i < n; i++)
                {
                    int fst = rnd.Next(1, 13);
                    int sec = rnd.Next(2, 35);
                    if (salon[fst, sec] != "0")
                    {
                        salon[fst, sec] = "2";
                    }
                    else
                    {
                        n++;
                    }
                }
                //СОХРАНЕНИЕ NEW СОСТОЯНИЯ
                Database.update("flight_number", "num", flight_num, "red_places", Tool.ArrayToString(salon));
                Console.WriteLine("SAVE!");
            }
            
            
            for (int i = 0; i < salon.GetLength(0); i++)
            {
                for (int j = 0; j < salon.GetLength(1); j++)
                {
                    if (salon[i, j] == "1")
                    {
                        Console.ForegroundColor = ConsoleColor.DarkBlue;
                        Console.Write(" ■  ");
                        Console.ResetColor();
                    }
                    else if (salon[i, j] == "0")
                    {
                        Console.Write("   ");
                    }
                    else if (salon[i, j] == "2")
                    {
                        Console.ForegroundColor = ConsoleColor.Red;
                        Console.Write(" □  ");
                        Console.ResetColor();
                    }
                    else if (salon[i, j] == "3")
                    {
                        Console.ForegroundColor = ConsoleColor.Green;
                        Console.Write(" ■  ");
                        Console.ResetColor();
                    }
                    else
                    {
                        Console.Write($" {salon[i, j]} ");
                    }

                }

                Console.WriteLine();
            }

            if (Database.get_string("booking", "book_num", book_num, 6) == Database.get_string("booking", "book_num", book_num, 3))
            {
                string? sts = Database.get_string("booking", "book_num", book_num, 5);
                salon = Tool.StringToArray(sts);
            }
            else
            {
                int pax = Convert.ToInt32(Database.get_string("booking", "book_num", book_num, 3));
                int i = 0;
                for (i = 0; i < pax; i++)
                {
                    Console.Write($"\nВыберите место для пассажира: {i+1}\n\nРяд(цифра): ");
                    int row = Convert.ToInt32(Console.ReadLine());
                    Console.Write("Место(буква): ");
                    
                    string keyy = Console.ReadLine();
                    int wrd = 6;
                    for (int j = 0; j < salon.GetLength(0); j++)
                    {
                        if (keyy == Hletter[j])
                        {
                            wrd = j;
                            break;
                        }
                    }
                    salon[wrd, row + 1] = "3";
                }

                Database.update("booking", "book_num", book_num, "place", Tool.ArrayToString(salon));
                Database.update("booking", "book_num", book_num, "chk", Convert.ToString(i));
            }
            Console.Clear();
            Console.Write(" ");

            for (int i = 0; i < salon.GetLength(0); i++)
            {
                for (int j = 0; j < salon.GetLength(1); j++)
                {
                    if (salon[i, j] == "1")
                    {
                        Console.ForegroundColor = ConsoleColor.DarkBlue;
                        Console.Write(" ■  ");
                        Console.ResetColor();
                    }
                    else if (salon[i, j] == "0")
                    {
                        Console.Write("   ");
                    }
                    else if (salon[i, j] == "2")
                    {
                        Console.ForegroundColor = ConsoleColor.Red;
                        Console.Write(" □  ");
                        Console.ResetColor();
                    }
                    else if (salon[i, j] == "3")
                    {
                        Console.ForegroundColor = ConsoleColor.Green;
                        Console.Write(" ■  ");
                        Console.ResetColor();
                    }
                    else
                    {
                        Console.Write($" {salon[i, j]} ");
                    }
                }
                Console.WriteLine();
            }
        }
        
        else
        {
            string[,] salon = new string[8, 35]
            {
                { " ", "|", "33", "32", "31", "30", "29", "28", "27", "26", "25", "24", "23", "22", "21", "20", "19", "18", "17", "16", " ", "14", "13", "12", "11", "10", "09", "08", "07", "06", "05", "04", "03", "02", "01" },
                { "A", "|", "1", "1", "2", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
                { "B", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
                { "C", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
                { " ", "|", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"},
                { "D", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
                { "E", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
                { "F", "|", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"},
            };
            
            for (int i = 0; i < salon.GetLength(0); i++)
            {
                for (int j = 0; j < salon.GetLength(1); j++)
                {
                    if (salon[i, j] == "1")
                    {
                        Console.ForegroundColor = ConsoleColor.DarkBlue;
                        Console.Write(" ■  ");
                        Console.ResetColor();
                    }
                    else if (salon[i, j] == "0")
                    {
                        Console.Write("   ");
                    }
                    else if (salon[i, j] == "2")
                    {
                        Console.ForegroundColor = ConsoleColor.Red;
                        Console.Write(" □  ");
                        Console.ResetColor();
                    }
                    else
                    {
                        Console.Write($" {salon[i, j]} ");
                    }

                }

                Console.WriteLine();
            }
        }
    }
}